In [1]:
import pandas as pd
import numpy as np

## Methods

In [2]:
data = {'name':['alice','bob','charlie'], 'age': [25,30,35]}
df = pd.DataFrame(data)

In [3]:
df['gender'] = 'Male'
df.head()

      name  age gender
0    alice   25   Male
1      bob   30   Male
2  charlie   35   Male

In [4]:
df.loc[3] = ['Rob', np.nan , 'Male']

In [5]:
df.head()

      name   age gender
0    alice  25.0   Male
1      bob  30.0   Male
2  charlie  35.0   Male
3      Rob   NaN   Male

In [6]:
df.loc[4] = ['Jane',24,'Female']

In [7]:
df.loc[1, 'gender'] = np.nan

In [8]:
df.head()

      name   age  gender
0    alice  25.0    Male
1      bob  30.0     NaN
2  charlie  35.0    Male
3      Rob   NaN    Male
4     Jane  24.0  Female

In [9]:
# To create null value in different location
df.loc[0, 'age'] = np.nan
df.loc[3, 'name'] = np.nan

In [10]:
df.head()

      name   age  gender
0    alice   NaN    Male
1      bob  30.0     NaN
2  charlie  35.0    Male
3      NaN   NaN    Male
4     Jane  24.0  Female

## Fillna()

In [11]:
#df['age'].fillna(26) #it didnt give the filled value in tabel below so we use
#df = df['age'].fillna(26)
df['age'].fillna(26, inplace=True)

In [12]:
df.head()

      name   age  gender
0    alice  26.0    Male
1      bob  30.0     NaN
2  charlie  35.0    Male
3      NaN  26.0    Male
4     Jane  24.0  Female

## Dropna()

In [13]:
df.dropna(inplace=True) # It drops the whole row with NAN/Null value

In [14]:
df.head()

      name   age  gender
0    alice  26.0    Male
2  charlie  35.0    Male
4     Jane  24.0  Female

In [15]:
df.drop('gender', axis=1) #it drops the whole column

      name   age
0    alice  26.0
2  charlie  35.0
4     Jane  24.0

In [16]:
df.head()

      name   age  gender
0    alice  26.0    Male
2  charlie  35.0    Male
4     Jane  24.0  Female

In [17]:
df.reset_index() #it reset the index number in table/dataframe

   index     name   age  gender
0      0    alice  26.0    Male
1      2  charlie  35.0    Male
2      4     Jane  24.0  Female

In [18]:
df.reset_index().drop('index', axis=1)
# df.reset_index(drop=True)

      name   age  gender
0    alice  26.0    Male
1  charlie  35.0    Male
2     Jane  24.0  Female

In [19]:
df.head()

      name   age  gender
0    alice  26.0    Male
2  charlie  35.0    Male
4     Jane  24.0  Female

In [20]:
df = df.reset_index(drop=True)

In [21]:
df.head()

      name   age  gender
0    alice  26.0    Male
1  charlie  35.0    Male
2     Jane  24.0  Female

In [22]:
df.columns

Index(['name', 'age', 'gender'], dtype='object')

In [23]:
col_mapper = {'name': 'Name', 'age': 'Age', 'gender': 'Gender'}

To Rename the given column

In [24]:
df.rename(columns = col_mapper, inplace=True)

In [25]:
df.head()

      Name   Age  Gender
0    alice  26.0    Male
1  charlie  35.0    Male
2     Jane  24.0  Female

Apply() to map/use function in pandas

In [26]:
def double(x):
    return x*2

In [37]:
df['Age'].apply(double)

0    52.0
1    70.0
2    48.0
Name: Age, dtype: float64

In [38]:
df.head()

      Name   Age  Gender
0    alice  26.0    Male
1  charlie  35.0    Male
2     Jane  24.0  Female

In [46]:
df['Age'].apply(lamda:x:x**2)

SyntaxError: invalid syntax (2325370195.py, line 1)

In [39]:
grouped_df = df.groupby('Gender')

In [40]:
grouped_df

Grouped.agg() this is aggregate function very imp in interview

In [42]:
grouped_df.agg({'Age': "mean"})

         Age
Gender
Female  24.0
Male    30.5